{"config": {"name": "sequential_1", "layers": [{"config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "cropping": [[60, 20], [0, 0]], "batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1"}, "class_name": "Cropping2D"}, {"config": {"dtype": "float32", "name": "lambda_1", "output_shape": [80, 320, 3], "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgX0DnAAAAAAAA\n4D+pACkB2gF4cgMAAAByAwAAAPoKLi9tb2RlbC5wedoIPGxhbWJkYT5tAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "arguments": {}, "batch_input_shape": [null, 80, 320, 3], "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_size": [5, 5], "filters": 24, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_size": [5, 5], "filters": 36, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_size": [5, 5], "filters": 48, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [1, 1], "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_5", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "valid", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [1, 1], "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 100, "name": "dense_1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 50, "name": "dense_2", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 10, "name": "dense_3", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 1, "name": "dense_4", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}