{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "dtype": "float32", "data_format": "channels_last", "cropping": [[60, 20], [0, 0]], "trainable": true}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "batch_input_shape": [null, 80, 320, 3], "output_shape_type": "raw", "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgX0DnAAAAAAAA\n4D+pACkB2gF4cgMAAAByAwAAAPoKLi9tb2RlbC5wedoIPGxhbWJkYT5oAAAAcwAAAAA=\n", null, null], "arguments": {}, "trainable": true, "output_shape": [80, 320, 3], "function_type": "lambda"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_1", "kernel_constraint": null, "filters": 24, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_2", "kernel_constraint": null, "filters": 36, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_3", "kernel_constraint": null, "filters": 48, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"padding": "valid", "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_4", "kernel_constraint": null, "filters": 64, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_5", "kernel_constraint": null, "filters": 64, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "rate": 0.2, "noise_shape": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_1", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_2", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_3", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_4", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true}}]}}